In [2]:
%pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Collecting pandas
  Downloading pandas-2.2.3-cp39-cp39-macosx_11_0_arm64.whl (11.3 MB)
     |████████████████████████████████| 11.3 MB 897 kB/s eta 0:00:01
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/sagarwal/Library/Python/3.9/lib/python/site-packages (from pandas) (2.9.0.post0)
Collecting numpy>=1.22.4
  Downloading numpy-2.0.2-cp39-cp39-macosx_14_0_arm64.whl (5.3 MB)
     |████████████████████████████████| 5.3 MB 17.5 MB/s eta 0:00:01
Collecting tzdata>=2022.7
  Downloading tzdata-2024.2-py2.py3-none-any.whl (346 kB)
     |████████████████████████████████| 346 kB 17.2 MB/s eta 0:00:01
Collecting pytz>=2020.1
  Downloading pytz-2024.2-py2.py3-none-any.whl (508 kB)
     |████████████████████████████████| 508 kB 16.8 MB/s eta 0:00:01
Requirement already satisfied: six>=1.5 in /Library/Developer/CommandLineTools/Library/Frameworks/Python3.framework/Versions/3.9/lib/python3.9/site-packages (from python-dateutil>=2.8.2->pandas) (1.15.0)
Installing collected packages: tzdata, pytz, numpy, pandas
Successfully installed numpy-2.0.2 pandas-2.2.3 pytz-2024.2 tzdata-2024.2
WARNING: You are using pip version 21.2.4; however, version 24.2 is available.
You should consider upgrading via the '/Library/Developer/CommandLineTools/usr/bin/python3 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame({'Name': ['RACHEL', 'MONICA', 'PHOEBE',
                                   'ROSS', 'CHANDLER', 'JOEY'],
                          
                          'Age': [30, 35, 37, 33, 34, 30],
                          
                          'Salary': [100000, 93000, 88000, 120000, 94000, 95000],
                          
                          'JOB': ['DESIGNER', 'CHEF', 'MASUS', 'PALENTOLOGY',
                                  'IT', 'ARTIST']})

In [39]:
df['Name'] = df['Name'].str().trim()

TypeError: 'StringMethods' object is not callable

In [5]:
df

       Name  Age  Salary          JOB
0    RACHEL   30  100000     DESIGNER
1    MONICA   35   93000         CHEF
2    PHOEBE   37   88000        MASUS
3      ROSS   33  120000  PALENTOLOGY
4  CHANDLER   34   94000           IT
5      JOEY   30   95000       ARTIST

In [9]:
df.query("Name==['MONICA','PHOEBE'] OR Name.str.contains('R*')")

SyntaxError: invalid syntax (<unknown>, line 1)

In [13]:
df.query("Name.str.contains('R+') | Name.str.startswith('RA')")

       Name  Age  Salary          JOB
0    RACHEL   30  100000     DESIGNER
3      ROSS   33  120000  PALENTOLOGY
4  CHANDLER   34   94000           IT

In [16]:
df

       Name  Age  Salary          JOB
0    RACHEL   30  100000     DESIGNER
1    MONICA   35   93000         CHEF
2    PHOEBE   37   88000        MASUS
3      ROSS   33  120000  PALENTOLOGY
4  CHANDLER   34   94000           IT
5      JOEY   30   95000       ARTIST

In [20]:
df.query("Name=='MONICA'| Salary==120000| JOB.str.startswith('ART')")

     Name  Age  Salary          JOB
1  MONICA   35   93000         CHEF
3    ROSS   33  120000  PALENTOLOGY
5    JOEY   30   95000       ARTIST

In [ ]:
fieldA=='valueA' | fieldA=='valueB' | fieldA.str.startswith('valueC')